Revit 2026 API

# LineLightShape(LineLightShape) Constructor

---

Creates a copy of the given line light shape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LineLightShape(
	LineLightShape other
)
```
```vb
Public Sub New (
	other As LineLightShape
)
```
```cpp
public:
LineLightShape(
	LineLightShape^ other
)
```
```fsharp
new :
        other : LineLightShape -> LineLightShape
```

#### Parameters

other LineLightShape

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LineLightShape Class

LineLightShape Overload

Autodesk.Revit.DB.Lighting Namespace